Repository: google/dart-scissors
Catalog: cssjanus/locale/*/LC_MESSAGES/django.po
Languages: ar, zh_cn

source: Change Language
ar: تغيير اللغة
zh_cn: 切换语言

source: Left-to-Right-to-Left-ifyer
ar: من اليسار إلى اليمين إلى اليسار
zh_cn: 从左到右-从右到左转换器

source: This webapp uses cssjanus.py to convert LTR(left to right) properties and values in a CSS file to RTL counterparts and vice-versa.
ar: هذا التطبيق يستخدم لتحويل الاتجاه من اليمين لليسار والعكس، سواءً في الخصائص أو القيم لملفات صفحات الأنماط السي إس إس
zh_cn: 此应用程序使用 cssjanus.py, 把 CSS 文件中从左到右属性和数值转换为对应的从右到左属性和数值. 也可以进行逆操作.

source: Author:
ar: المؤلف :
zh_cn: 作者:

source: Paste or Type CSS:
ar: اكتب أو الصق ملف الأنماط هنا:
zh_cn: 粘帖或输入 CSS:

source: OR use an URI to a CSS file:
ar: أو جرب رابطاً لملف أنماط خارجي:
zh_cn: <strong>或</strong>输入 CSS 文件的 URI:

source: Flags
ar: إشارات
zh_cn: 标志

source: Run CSSJanus!
ar: نفّذ العملية
zh_cn: 运行 CSSJanus!

source: Reset
ar: إعادة تعيين
zh_cn: 清空

source: Result CSS:
ar: نتيجة CSS :
zh_cn: 转换结果:

source: Results will appear here...
ar: النتائج ستظهر هنا...
zh_cn: 结果会在此显示...

source: You could also embed this webapp directly in your markup with your publicly accessible CSS files like so:
ar: باستطاعتك أيضاً أن تدمج هذا التطبيق في شفرتك البرمجية لموقعك، شرط أن يكون ملف الأنماط متاحاً على الويب
zh_cn: 你也可以把此应用程序与 CSS 文件 (需可公开访问) 一起直接嵌入到页面中, 如下所示:

source: Try this example CSS!
ar: جرب هذا المثال لملف الأنماط
zh_cn: 试一下我们的示例 CSS!

source: You need to put some text in the css field or uri field.
ar: يجب أن تكتب شيئاً في حقل الأنماط أو في رابط الملف.
zh_cn: 你必须先在 css 域或 uri 域中输入点什么.
